{
  "home": {
    "name": "Vamsi Krishna A",
    "summary": "Results-driven software developer with 5+ years of experience in designing, building, and maintaining scalable applications. Recently completed a Master’s degree in Artificial Intelligence, enhancing expertise in cutting-edge technologies and intelligent systems. Strong collaborator with a passion for solving complex problems, delivering user-focused solutions, and continuously learning to stay ahead in a fast-evolving tech landscape.",
    "roles": [
      "Software Developer",
      "AI Enthusiast",
      "Full stack Engineer"
    ],
    "cvurl": "#",
    "linkedin": "https://www.linkedin.com/in/vamsi-krishna-athipatla",
    "github": "https://github.com/krish8237"
  },
  "about": {
    "imageurl": "./static/certs/profile-pic.png",
    "description": [
      "I'm a passionate and results-driven software developer with a strong foundation in building scalable and user-focused applications. With 3.6 years of professional experience, I've had the opportunity to work on a variety of projects, from backend microservices to dynamic front-end components.",
      "My journey in technology led me to pursue a Master's degree in Artificial Intelligence, where I've been able to dive deep into machine learning, NLP, and big data analytics. I enjoy tackling complex problems and am always eager to learn and apply new technologies to create innovative solutions.",
      "As a strong collaborator, I thrive in team environments and am dedicated to continuous learning to stay at the forefront of the ever-evolving tech landscape."
    ]
  },
  "skills": [
    {
      "category": "Programming & Web",
      "items": [
        "Java",
        "Python",
        "Golang",
        "C++",
        "HTML/CSS",
        "JavaScript",
        "Angular",
        "React"
      ]
    },
    {
      "category": "Frameworks",
      "items": [
        "Spring Boot",
        "Flask",
        "Django",
        "FastAPI",
        "PyTest",
        "JUnit"
      ]
    },
    {
      "category": "Databases",
      "items": [
        "MySQL",
        "PostgreSQL",
        "MongoDB",
        "SQLite",
        "FAISS DB"
      ]
    },
    {
      "category": "DevOps & Cloud",
      "items": [
        "Jenkins",
        "Docker",
        "Kubernetes",
        "AWS",
        "GitLab CI/CD",
        "OpenShift",
        "ArgoCD"
      ]
    },
    {
      "category": "AI/ML",
      "items": [
        "Machine Learning",
        "Deep Learning",
        "NLP",
        "LLMs",
        "Generative AI",
        "LangChain"
      ]
    },
    {
      "category": "Developer Tools",
      "items": [
        "IntelliJ",
        "PyCharm",
        "VSCode",
        "Jupyter",
        "GitHub Copilot",
        "Amazon Q"
      ]
    }
  ],
  "experience": [
    {
      "company": "Continental",
      "role": "Senior Software Developer",
      "period": "Apr 2023 - Jan 2024",
      "location": "Bangalore, India",
      "points": [
        "Designed and implemented standalone tools using Python and Django to verify and validate the software image variants.",
        "Implemented Rest APIs using the Fast API and GraphQL for Single point entry.",
        "Worked on developing a Java Spring Boot microservices to manage the Atlassian (Jira/Confluence) Work flows and achieved in decreasing 80% of the manual effort.",
        "Developed data pipelines using Python, Pandas and PySpark that analyzes the DLT logs and generates the performance reports of the software images for the selected measurement cycles.",
        "Automated 15+ software delivery and application workflows by setting up the pipelines using Jenkins, Docker, Kubernetes, Open shift, ArgoCD and GitHub webhooks."
      ]
    },
    {
      "company": "Tata Consultancy Services",
      "role": "Software Developer",
      "period": "Aug 2020 - Mar 2023",
      "location": "Bangalore, India",
      "points": [
        "Developed secured Java Spring Boot microservices with GraphQL to support core business functionalities like order management, securities trading, and automated investment workflows for Marcus.",
        "Maintained 10+ microservices that are responsible for core business of Marcus platform and connected a few of them with multiple upstream and downstream services, ensuring seamless data flow across platforms.",
        "Built ETL data streams within Spring Boot using internal frameworks and Apache Kafka for real-time processing of position data.",
        "Utilized AWS services such as EC2, Cloud Formation, Lambda, CloudWatch, and Step Functions to support scalable and event-driven processing."
      ]
    }
  ],
  "education": [
    {
      "institution": "University of North Texas",
      "degree": "Master of Science in AI",
      "period": "Jan 2024 - May 2025",
      "location": "Denton, TX, USA",
      "details": "Key Learnings: Machine Learning, Deep Learning, NLP, Big Data Analytics."
    },
    {
      "institution": "Sreenivasa Institute of Technology",
      "degree": "Bachelor of Technology in CS",
      "period": "Aug 2016 - Sep 2020",
      "location": "Chittoor, AP, IN"
    }
  ],
  "projects": [
    {
      "name": "MediBot using LLMs",
      "description": "A medical question-answering bot leveraging various Large Language Models on the MedQuad dataset (47.5K QA pairs), utilizing FAISS for vector storage, Sentence T5 for embeddings, and ColBERTv2 for re-ranking to provide accurate medical information.",
      "stack": [
        "Python",
        "FastAPI",
        "FAISS",
        "LangChain",
        "PyTorch",
        "HuggingFace"
      ],
      "url": "#"
    },
    {
      "name": "GitHub-Jira Agent",
      "description": "An intelligent agent that interprets tasks described in Jira tickets, automatically generates corresponding code solutions, and pushes the implementation to a GitHub repository, streamlining the development workflow.",
      "stack": [
        "Python",
        "Google GenAI",
        "LangChain",
        "LangGraph",
        "Jira API"
      ],
      "url": "#"
    },
    {
      "name": "Online Fraud Detection",
      "description": "A robust fraud detection system for online credit transactions using advanced data sampling methods (SMOTE, ADASYN) and an ensemble learning model combining Logistic Regression, XGBoost, and Neural Networks to handle imbalanced data.",
      "stack": [
        "Python",
        "Scikit-learn",
        "PyTorch",
        "XGBoost",
        "Pandas"
      ],
      "url": "#"
    },
    {
      "name": "Attendance System",
      "description": "An advanced attendance management system that uses Convolutional Neural Networks (CNN) and Haar Cascade classifiers for real-time facial recognition, built with a Django backend and a responsive user interface.",
      "stack": [
        "Python",
        "Django",
        "PyTorch",
        "CNN",
        "OpenCV"
      ],
      "url": "#"
    }
  ],
  "certifications": [
    {
      "name": "AWS Certified Cloud Practitioner",
      "date": "Mar 2023",
      "logourl": "./static/certs/aws.png",
      "credentialurl": "./static/certs/aieng_dc.png"
    },
    {
      "name": "Oracle Certified Professional, Java SE 11",
      "date": "Aug 2022",
      "logourl": "./static/certs/java.png",
      "credentialurl": "https://placehold.co/800x600/1e293b/ffffff?text=Java+Certificate"
    },
    {
      "name": "Docker Certified Associate",
      "date": "May 2023",
      "logourl": "https://placehold.co/80x80/ffffff/0f172a?text=Docker",
      "credentialurl": "https://placehold.co/800x600/1e293b/ffffff?text=Docker+Certificate"
    }
  ],
  "contact": {
    "message": "I'm currently seeking new opportunities and would love to hear from you.",
    "email": "vamsikrishnaathipatla@gmail.com"
  }
}